hotRoom6I_yPlusBox/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
1400
(
39.0972
39.0972
39.0972
39.0972
39.0972
39.0972
39.0972
39.0972
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
1400
(
52.8412
52.8412
52.8412
52.8412
52.8412
52.8412
52.8412
52.8412
...
)
;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    side01
    {
        type            symmetry;
    }
    side02
    {
        type            symmetry;
    }
}


// ************************************************************************* //
