hotRoom6I_yPlusBox/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       234298;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       235898;
    }
    outlet
    {
        type            patch;
        nFaces          1000;
        startFace       237498;
    }
    inlet
    {
        type            patch;
        nFaces          1000;
        startFace       238498;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4000;
        startFace       239498;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          4000;
        startFace       243498;
    }
    box
    {
        type            wall;
        inGroups        1(wall);
        nFaces          364;
        startFace       247498;
    }
)

// ************************************************************************* //
